LaborEtArs/ESP8266mDNS/src/ESP8266mDNSv2.cpp
/*
 * ESP8266mDNS.cpp
 *
 *  License (MIT license):
 *    Permission is hereby granted, free of charge, to any person obtaining a copy
 *    of this software and associated documentation files (the "Software"), to deal
 *    in the Software without restriction, including without limitation the rights
 *    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 *    copies of the Software, and to permit persons to whom the Software is
 *    furnished to do so, subject to the following conditions:
 *
 *    The above copyright notice and this permission notice shall be included in
 *    all copies or substantial portions of the Software.
 *
 *    THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 *    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 *    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 *    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 *    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 *    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 *    THE SOFTWARE.
 *
 */

#include "ESP8266mDNS-Priv.h"

/*
 * LEA_MDNSResponder
 */
namespace LEA_MDNSResponder {

/**
 * STRINGIZE
 */
#ifndef STRINGIZE
    #define STRINGIZE(x) #x
#endif
#ifndef STRINGIZE_VALUE_OF
    #define STRINGIZE_VALUE_OF(x) STRINGIZE(x)
#endif


/**
 * INTERFACE
 */

/**
 * MDNSResponder::MDNSResponder
 */
MDNSResponder::MDNSResponder(void)
:   m_pServices(0),
    m_pUDPContext(0),
    m_pcHostname(0),
    m_pServiceQueries(0),
    m_fnServiceTxtCallback(0),
    m_pServiceTxtCallbackUserdata(0) {
    
}

/*
 * MDNSResponder::~MDNSResponder
 */
MDNSResponder::~MDNSResponder(void) {
    
    _resetProbeStatus(false);
    _releaseServiceQueries();
    _releaseHostname();
    _releaseUDPContext();
    _releaseServices();
}

/*
 * MDNSResponder::begin
 *
 * Set the host domain (for probing) and install WiFi event handlers for
 * IP assignment and disconnection management. In both cases, the MDNS responder
 * is restarted (reset and restart probe status)
 * Finally the responder is (re)started
 *
 */
bool MDNSResponder::begin(const char* p_pcHostname) {
    
    bool    bResult = false;
    
    if (_setHostname(p_pcHostname)) {
        
        m_GotIPHandler = WiFi.onStationModeGotIP([this](const WiFiEventStationModeGotIP& pEvent) {
            (void) pEvent;
            _restart();
        });

        m_DisconnectedHandler = WiFi.onStationModeDisconnected([this](const WiFiEventStationModeDisconnected& pEvent) {
            (void) pEvent;
            _restart();
        });
            
        bResult = _restart();
    }
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] begin: FAILED for '%s'!\n"), (p_pcHostname ?: "-")); } );    
    return bResult;
}

/*
 * MDNSResponder::begin (LEGACY)
 */
bool MDNSResponder::begin(const char* p_pcHostname,
                          IPAddress p_IPAddress,
                          uint32_t p_u32TTL /*= 120*/) {
    
    (void) p_IPAddress;
    (void) p_u32TTL;
    return begin(p_pcHostname);
}

/*
 * MDNSResponder::close
 *
 * Ends the MDNS responder.
 * Announced services are unannounced (by multicasting a goodbye message)
 *
 */
bool MDNSResponder::close(void) {
    
    _announce(false);
    _resetProbeStatus(false);   // Stop probing

    _releaseServiceQueries();
    _releaseUDPContext();
    _releaseHostname();
    
    return true;
}

/*
 * MDNSResponder::setHostname
 *
 * Replaces the current hostname and restarts probing.
 * For services without own instance name (when the host name was used a instance
 * name), the instance names are replaced also (and the probing is restarted).
 *
 */
bool MDNSResponder::setHostname(const char* p_pcHostname) {
    
    bool    bResult = false;

    if (_setHostname(p_pcHostname)) {
        m_HostProbeInformation.m_ProbingStatus = ProbingStatus_ReadyToStart;

        // Replace 'auto-set' service names
        bResult = true;
        for (stcMDNSService* pService=m_pServices; ((bResult) && (pService)); pService=pService->m_pNext) {
            if (pService->m_bAutoName) {
                bResult = pService->setName(p_pcHostname);
                pService->m_ProbeInformation.m_ProbingStatus = ProbingStatus_ReadyToStart;
            }
        }
    }
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] setHostname: FAILED for '%s'!\n"), (p_pcHostname ?: "-")); } );    
    return bResult;
}

/*
 * MDNSResponder::setHostname (LEGACY)
 */
bool MDNSResponder::setHostname(String p_strHostname) {
    
    return setHostname(p_strHostname.c_str());
}


/*
 * SERVICES
 */
 
/*
 * MDNSResponder::addService
 *
 * Add service; using hostname if no name is explicitly provided for the service
 * The usual '_' underline, which is prepended to service and protocol, eg. _http,
 * may be given. If not, it is added automatically.
 *
 */
MDNSResponder::hMDNSService MDNSResponder::addService(const char* p_pcName,
                                                      const char* p_pcService,
                                                      const char* p_pcProtocol,
                                                      uint16_t p_u16Port) {

    hMDNSService    hResult = 0;
    
    if (((!p_pcName) ||                                                     // NO name OR
         (MDNS_DOMAIN_LABEL_MAXLENGTH >= os_strlen(p_pcName))) &&           // Fitting name
        (p_pcService) &&
        (MDNS_SERVICE_NAME_LENGTH >= os_strlen(p_pcService)) &&
        (p_pcProtocol) &&
        ((MDNS_SERVICE_PROTOCOL_LENGTH - 1) != os_strlen(p_pcProtocol)) &&
        (p_u16Port)) {
        
        if (!_findService((p_pcName ?: m_pcHostname), p_pcService, p_pcProtocol)) { // Not already used
            if (0 != (hResult = (hMDNSService)_allocService(p_pcName, p_pcService, p_pcProtocol, p_u16Port))) {
                
                // Start probing
                ((stcMDNSService*)hResult)->m_ProbeInformation.m_ProbingStatus = ProbingStatus_ReadyToStart;
          }
        }
    }   // else: bad arguments
    DEBUG_EX_ERR(if (!hResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] addService: FAILED to add '%s.%s.%s'!\n"), (p_pcName ?: "-"), p_pcService, p_pcProtocol); } );    
    return hResult;
}

