LaborEtArs/ESP8266mDNS/src/ESP8266mDNSv2.cpp
/*
 * MDNSResponder::removeService
 *
 * Unanounce a service (by sending a goodbye message) and remove it
 * from the MDNS responder
 *
 */
bool MDNSResponder::removeService(const MDNSResponder::hMDNSService p_hService) {
    
    stcMDNSService* pService = 0;
    bool    bResult = (((pService = _findService(p_hService))) &&
                       (_announceService(*pService, false)) &&
                       (_releaseService(pService)));
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] removeService: FAILED!\n")); } );    
    return bResult;
}

/*
 * MDNSResponder::removeService
 */
bool MDNSResponder::removeService(const char* p_pcName,
                                  const char* p_pcService,
                                  const char* p_pcProtocol) {
    
    return removeService((hMDNSService)_findService((p_pcName ?: m_pcHostname), p_pcService, p_pcProtocol));
}

/*
 * MDNSResponder::addService (LEGACY)
 */
bool MDNSResponder::addService(String p_strService,
                               String p_strProtocol,
                               uint16_t p_u16Port) {
    
    return (0 != addService(m_pcHostname, p_strService.c_str(), p_strProtocol.c_str(), p_u16Port));
}

/*
 * MDNSResponder::setServiceName
 */
bool MDNSResponder::setServiceName(const MDNSResponder::hMDNSService p_hService,
                                   const char* p_pcInstanceName) {

    stcMDNSService* pService = 0;
    bool    bResult = (((!p_pcInstanceName) ||
                        (MDNS_DOMAIN_LABEL_MAXLENGTH >= os_strlen(p_pcInstanceName))) &&
                       ((pService = _findService(p_hService))) &&
                       (pService->setName(p_pcInstanceName)) &&
                       ((pService->m_ProbeInformation.m_ProbingStatus = ProbingStatus_ReadyToStart)));
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] setServiceName: FAILED for '%s'!\n"), (p_pcInstanceName ?: "-")); } );    
    return bResult;
}

/*
 * SERVICE TXT
 */

/*
 * MDNSResponder::addServiceTxt
 *
 * Add a static service TXT item ('Key'='Value') to a service.
 *
 */
MDNSResponder::hMDNSTxt MDNSResponder::addServiceTxt(const MDNSResponder::hMDNSService p_hService,
                                                     const char* p_pcKey,
                                                     const char* p_pcValue) {
    
    hMDNSTxt    hTxt = 0;
    stcMDNSService* pService = _findService(p_hService);
    if (pService) {
        hTxt = (hMDNSTxt)_addServiceTxt(pService, p_pcKey, p_pcValue, false);
    }
    DEBUG_EX_ERR(if (!hTxt) { DEBUG_OUTPUT.printf(F("[MDNSResponder] addServiceTxt: FAILED for '%s=%s'!\n"), (p_pcKey ?: "-"), (p_pcValue ?: "-")); } );    
    return hTxt;
}

/*
 * MDNSResponder::addServiceTxt (uint32_t)
 *
 * Formats: http://www.cplusplus.com/reference/cstdio/printf/
 */
MDNSResponder::hMDNSTxt MDNSResponder::addServiceTxt(const MDNSResponder::hMDNSService p_hService,
                                                     const char* p_pcKey,
                                                     uint32_t p_u32Value) {
    char    acBuffer[32];   *acBuffer = 0;
    sprintf(acBuffer, "%u", p_u32Value);

    return addServiceTxt(p_hService, p_pcKey, acBuffer);
}

/*
 * MDNSResponder::addServiceTxt (uint16_t)
 */
MDNSResponder::hMDNSTxt MDNSResponder::addServiceTxt(const MDNSResponder::hMDNSService p_hService,
                                                     const char* p_pcKey,
                                                     uint16_t p_u16Value) {
    char    acBuffer[16];   *acBuffer = 0;
    sprintf(acBuffer, "%hu", p_u16Value);

    return addServiceTxt(p_hService, p_pcKey, acBuffer);
}

/*
 * MDNSResponder::addServiceTxt (uint8_t)
 */
MDNSResponder::hMDNSTxt MDNSResponder::addServiceTxt(const MDNSResponder::hMDNSService p_hService,
                                                     const char* p_pcKey,
                                                     uint8_t p_u8Value) {
    char    acBuffer[8];    *acBuffer = 0;
    sprintf(acBuffer, "%hhu", p_u8Value);

    return addServiceTxt(p_hService, p_pcKey, acBuffer);
}

/*
 * MDNSResponder::addServiceTxt (int32_t)
 */
MDNSResponder::hMDNSTxt MDNSResponder::addServiceTxt(const MDNSResponder::hMDNSService p_hService,
                                                     const char* p_pcKey,
                                                     int32_t p_i32Value) {
    char    acBuffer[32];   *acBuffer = 0;
    sprintf(acBuffer, "%i", p_i32Value);

    return addServiceTxt(p_hService, p_pcKey, acBuffer);
}

/*
 * MDNSResponder::addServiceTxt (int16_t)
 */
MDNSResponder::hMDNSTxt MDNSResponder::addServiceTxt(const MDNSResponder::hMDNSService p_hService,
                                                     const char* p_pcKey,
                                                     int16_t p_i16Value) {
    char    acBuffer[16];   *acBuffer = 0;
    sprintf(acBuffer, "%hi", p_i16Value);

    return addServiceTxt(p_hService, p_pcKey, acBuffer);
}

/*
 * MDNSResponder::addServiceTxt (int8_t)
 */
MDNSResponder::hMDNSTxt MDNSResponder::addServiceTxt(const MDNSResponder::hMDNSService p_hService,
                                                     const char* p_pcKey,
                                                     int8_t p_i8Value) {
    char    acBuffer[8];    *acBuffer = 0;
    sprintf(acBuffer, "%hhi", p_i8Value);

    return addServiceTxt(p_hService, p_pcKey, acBuffer);
}

/*
 * MDNSResponder::removeServiceTxt
 *
 * Remove a static service TXT item from a service.
 */
bool MDNSResponder::removeServiceTxt(const MDNSResponder::hMDNSService p_hService,
                                     const MDNSResponder::hMDNSTxt p_hTxt) {

    bool    bResult = false;
    
    stcMDNSService* pService = _findService(p_hService);
    if (pService) {
        stcMDNSServiceTxt*  pTxt = _findServiceTxt(pService, p_hTxt);
        if (pTxt) {
            bResult = _releaseServiceTxt(pService, pTxt);
        }
    }
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] removeServiceTxt: FAILED!\n")); } );    
    return bResult;
}

