LaborEtArs/ESP8266mDNS/src/ESP8266mDNSv2.cpp
/*
 * MDNSResponder::removeServiceTxt
 */
bool MDNSResponder::removeServiceTxt(const MDNSResponder::hMDNSService p_hService,
                                     const char* p_pcKey) {

    bool    bResult = false;
    
    stcMDNSService* pService = _findService(p_hService);
    if (pService) {
        stcMDNSServiceTxt*  pTxt = _findServiceTxt(pService, p_pcKey);
        if (pTxt) {
            bResult = _releaseServiceTxt(pService, pTxt);
        }
    }
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] removeServiceTxt: FAILED for '%s'!\n"), (p_pcKey ?: "-")); } );    
    return bResult;
}

/*
 * MDNSResponder::removeServiceTxt
 */
bool MDNSResponder::removeServiceTxt(const char* p_pcName,
                                     const char* p_pcService,
                                     const char* p_pcProtocol,
                                     const char* p_pcKey) {

    bool    bResult = false;
    
    stcMDNSService* pService = _findService((p_pcName ?: m_pcHostname), p_pcService, p_pcProtocol);
    if (pService) {
        stcMDNSServiceTxt*  pTxt = _findServiceTxt(pService, p_pcKey);
        if (pTxt) {
            bResult = _releaseServiceTxt(pService, pTxt);
        }
    }
    return bResult;
}

/*
 * MDNSResponder::addServiceTxt (LEGACY)
 */
bool MDNSResponder::addServiceTxt(const char* p_pcService,
                                  const char* p_pcProtocol,
                                  const char* p_pcKey,
                                  const char* p_pcValue) {
    
    return (0 != _addServiceTxt(_findService(m_pcHostname, p_pcService, p_pcProtocol), p_pcKey, p_pcValue, false));
}

/*
 * MDNSResponder::addServiceTxt (LEGACY)
 */
bool MDNSResponder::addServiceTxt(String p_strService,
                                  String p_strProtocol,
                                  String p_strKey,
                                  String p_strValue) {
    
    return (0 != _addServiceTxt(_findService(m_pcHostname, p_strService.c_str(), p_strProtocol.c_str()), p_strKey.c_str(), p_strValue.c_str(), false));
}

/*
 * MDNSResponder::setDynamicServiceTxtCallback (global)
 *
 * Set a global callback for dynamic service TXT items. The callback is called, whenever
 * service TXT items are needed.
 *
 */
bool MDNSResponder::setDynamicServiceTxtCallback(MDNSResponder::MDNSDynamicServiceTxtCallbackFn p_fnCallback,
                                                 void* p_pUserdata) {
    
    m_fnServiceTxtCallback = p_fnCallback;
    m_pServiceTxtCallbackUserdata = p_pUserdata;
    
    return true;
}

/*
 * MDNSResponder::setDynamicServiceTxtCallback (service specific)
 *
 * Set a service specific callback for dynamic service TXT items. The callback is called, whenever
 * service TXT items are needed for the given service.
 *
 */
bool MDNSResponder::setDynamicServiceTxtCallback(MDNSResponder::hMDNSService p_hService,
                                                 MDNSResponder::MDNSDynamicServiceTxtCallbackFn p_fnCallback,
                                                 void* p_pUserdata) {

    bool    bResult = false;
    
    stcMDNSService* pService = _findService(p_hService);
    if (pService) {
        pService->m_fnTxtCallback = p_fnCallback;
        pService->m_pTxtCallbackUserdata = p_pUserdata;
        
        bResult = true;
    }   
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] setDynamicServiceTxtCallback: FAILED!\n")); } );    
    return bResult;
}

/*
 * MDNSResponder::addDynamicServiceTxt
 */
MDNSResponder::hMDNSTxt MDNSResponder::addDynamicServiceTxt(MDNSResponder::hMDNSService p_hService,
                                                            const char* p_pcKey,
                                                            const char* p_pcValue) {
    //DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] addDynamicServiceTxt (%s=%s)\n"), p_pcKey, p_pcValue););
    
    hMDNSTxt        hTxt = 0;

    stcMDNSService* pService = _findService(p_hService);
    if (pService) {
        hTxt = _addServiceTxt(pService, p_pcKey, p_pcValue, true);
    }
    DEBUG_EX_ERR(if (!hTxt) { DEBUG_OUTPUT.printf(F("[MDNSResponder] addDynamicServiceTxt: FAILED for '%s=%s'!\n"), (p_pcKey ?: "-"), (p_pcValue ?: "-")); } );
    return hTxt;
}

/*
 * MDNSResponder::addDynamicServiceTxt (uint32_t)
 */
MDNSResponder::hMDNSTxt MDNSResponder::addDynamicServiceTxt(MDNSResponder::hMDNSService p_hService,
                                                            const char* p_pcKey,
                                                            uint32_t p_u32Value) {

    char    acBuffer[32];   *acBuffer = 0;
    sprintf(acBuffer, "%u", p_u32Value);

    return addDynamicServiceTxt(p_hService, p_pcKey, acBuffer);
}

/*
 * MDNSResponder::addDynamicServiceTxt (uint16_t)
 */
MDNSResponder::hMDNSTxt MDNSResponder::addDynamicServiceTxt(MDNSResponder::hMDNSService p_hService,
                                                            const char* p_pcKey,
                                                            uint16_t p_u16Value) {

    char    acBuffer[16];   *acBuffer = 0;
    sprintf(acBuffer, "%hu", p_u16Value);

    return addDynamicServiceTxt(p_hService, p_pcKey, acBuffer);
}

/*
 * MDNSResponder::addDynamicServiceTxt (uint8_t)
 */
MDNSResponder::hMDNSTxt MDNSResponder::addDynamicServiceTxt(MDNSResponder::hMDNSService p_hService,
                                                            const char* p_pcKey,
                                                            uint8_t p_u8Value) {

    char    acBuffer[8];    *acBuffer = 0;
    sprintf(acBuffer, "%hhu", p_u8Value);

    return addDynamicServiceTxt(p_hService, p_pcKey, acBuffer);
}

/*
 * MDNSResponder::addDynamicServiceTxt (int32_t)
 */
MDNSResponder::hMDNSTxt MDNSResponder::addDynamicServiceTxt(MDNSResponder::hMDNSService p_hService,
                                                            const char* p_pcKey,
                                                            int32_t p_i32Value) {

    char    acBuffer[32];   *acBuffer = 0;
    sprintf(acBuffer, "%i", p_i32Value);

    return addDynamicServiceTxt(p_hService, p_pcKey, acBuffer);
}

