LaborEtArs/ESP8266mDNS/src/ESP8266mDNSv2.cpp
/*
 * MDNSResponder::addDynamicServiceTxt (int16_t)
 */
MDNSResponder::hMDNSTxt MDNSResponder::addDynamicServiceTxt(MDNSResponder::hMDNSService p_hService,
                                                            const char* p_pcKey,
                                                            int16_t p_i16Value) {

    char    acBuffer[16];   *acBuffer = 0;
    sprintf(acBuffer, "%hi", p_i16Value);

    return addDynamicServiceTxt(p_hService, p_pcKey, acBuffer);
}

/*
 * MDNSResponder::addDynamicServiceTxt (int8_t)
 */
MDNSResponder::hMDNSTxt MDNSResponder::addDynamicServiceTxt(MDNSResponder::hMDNSService p_hService,
                                                            const char* p_pcKey,
                                                            int8_t p_i8Value) {

    char    acBuffer[8];    *acBuffer = 0;
    sprintf(acBuffer, "%hhi", p_i8Value);

    return addDynamicServiceTxt(p_hService, p_pcKey, acBuffer);
}


/**
 * STATIC SERVICE QUERY (LEGACY)
 */
 
/*
 * MDNSResponder::queryService
 *
 * Perform a (blocking) static service query.
 * The arrived answers can be queried by calling:
 *  - answerHostname (or 'hostname')
 *  - answerIP (or 'IP')
 *  - answerPort (or 'port')
 *
 */
uint32_t MDNSResponder::queryService(const char* p_pcService,
                                     const char* p_pcProtocol,
                                     const uint16_t p_u16Timeout /*= MDNS_QUERYSERVICES_WAIT_TIME*/) {
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] queryService '%s.%s'\n"), p_pcService, p_pcProtocol););
    
    uint32_t    u32Result = 0;

    stcMDNSServiceQuery*    pServiceQuery = 0;
    if ((p_pcService) &&
        (os_strlen(p_pcService)) &&
        (p_pcProtocol) &&
        (os_strlen(p_pcProtocol)) &&
        (p_u16Timeout) &&
        (_removeLegacyServiceQuery()) &&
        ((pServiceQuery = _allocServiceQuery())) &&
        (_buildDomainForService(p_pcService, p_pcProtocol, pServiceQuery->m_ServiceTypeDomain))) {
        
        pServiceQuery->m_bLegacyQuery = true;
        
        if (_sendMDNSServiceQuery(*pServiceQuery)) {
            // Wait for answers to arrive
            DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] queryService: Waiting %u ms for answers...\n"), p_u16Timeout););
            delay(p_u16Timeout);

            // All answers should have arrived by now -> stop adding new answers
            pServiceQuery->m_bAwaitingAnswers = false;
            u32Result = pServiceQuery->answerCount();
        }
        else {  // FAILED to send query
            _removeServiceQuery(pServiceQuery);
        }
    }
    else {
        DEBUG_EX_ERR(DEBUG_OUTPUT.printf(F("[MDNSResponder] queryService: INVALID input data!\n"), p_pcService, p_pcProtocol););
    }
    return u32Result;
}

/*
 * MDNSResponder::removeQuery
 *
 * Remove the last static service query (and all answers).
 *
 */
bool MDNSResponder::removeQuery(void) {
    
    return _removeLegacyServiceQuery();
}

/*
 * MDNSResponder::queryService (LEGACY)
 */
uint32_t MDNSResponder::queryService(String p_strService,
                                     String p_strProtocol) {
    
    return queryService(p_strService.c_str(), p_strProtocol.c_str());
}

/*
 * MDNSResponder::answerHostname
 */
const char* MDNSResponder::answerHostname(const uint32_t p_u32AnswerIndex) {

    stcMDNSServiceQuery*            pServiceQuery = _findLegacyServiceQuery();
    stcMDNSServiceQuery::stcAnswer* pSQAnswer = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);

    if ((pSQAnswer) &&
        (pSQAnswer->m_HostDomain.m_u16NameLength) &&
        (!pSQAnswer->m_pcHostDomain)) {

        char*   pcHostDomain = pSQAnswer->allocHostDomain(pSQAnswer->m_HostDomain.c_strLength());
        if (pcHostDomain) {
            pSQAnswer->m_HostDomain.c_str(pcHostDomain);
        }
    }
    return (pSQAnswer ? pSQAnswer->m_pcHostDomain : 0);
}

#ifdef MDNS_IP4_SUPPORT
    /*
     * MDNSResponder::answerIP
     */
    IPAddress MDNSResponder::answerIP(const uint32_t p_u32AnswerIndex) {

        const stcMDNSServiceQuery*                              pServiceQuery = _findLegacyServiceQuery();
        const stcMDNSServiceQuery::stcAnswer*                   pSQAnswer = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        const stcMDNSServiceQuery::stcAnswer::stcIP4Address*    pIP4Address = (((pSQAnswer) && (pSQAnswer->m_pIP4Addresses)) ? pSQAnswer->IP4AddressAtIndex(0) : 0);
        return (pIP4Address ? pIP4Address->m_IPAddress : IPAddress());
    }
#endif

#ifdef MDNS_IP6_SUPPORT
    /*
     * MDNSResponder::answerIP6
     */
    IPAddress MDNSResponder::answerIP6(const uint32_t p_u32AnswerIndex) {

        const stcMDNSServiceQuery*                              pServiceQuery = _findLegacyServiceQuery();
        const stcMDNSServiceQuery::stcAnswer*                   pSQAnswer = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        const stcMDNSServiceQuery::stcAnswer::stcIP6Address*    pIP6Address = (((pSQAnswer) && (pSQAnswer->m_pIP6Addresses)) ? pSQAnswer->IP6AddressAtIndex(0) : 0);
        return (pIP6Address ? pIP6Address->m_IPAddress : IP6Address());
    }
#endif

/*
 * MDNSResponder::answerPort
 */
uint16_t MDNSResponder::answerPort(const uint32_t p_u32AnswerIndex) {

    const stcMDNSServiceQuery*              pServiceQuery = _findLegacyServiceQuery();
    const stcMDNSServiceQuery::stcAnswer*   pSQAnswer = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
    return (pSQAnswer ? pSQAnswer->m_u16Port : 0);
}

/*
 * MDNSResponder::hostname (LEGACY)
 */
String MDNSResponder::hostname(const uint32_t p_u32AnswerIndex) {
    
    return String(answerHostname(p_u32AnswerIndex));
}

/*
 * MDNSResponder::IP (LEGACY)
 */
IPAddress MDNSResponder::IP(const uint32_t p_u32AnswerIndex) {
    
    return answerIP(p_u32AnswerIndex);
}

/*
 * MDNSResponder::port (LEGACY)
 */
uint16_t MDNSResponder::port(const uint32_t p_u32AnswerIndex) {
    
    return answerPort(p_u32AnswerIndex);
}


/**
 * DYNAMIC SERVICE QUERY
 */

