LaborEtArs/ESP8266mDNS/src/ESP8266mDNSv2.cpp
/*
 * MDNSResponder::installServiceQuery
 *
 * Add a dynamic service query and a corresponding callback to the MDNS responder.
 * The callback will be called for every answer update.
 * The answers can also be queried by calling:
 *  - answerServiceDomain
 *  - answerHostDomain
 *  - answerIP4Address/answerIP6Address
 *  - answerPort
 *  - answerTxts
 *
 */
MDNSResponder::hMDNSServiceQuery MDNSResponder::installServiceQuery(const char* p_pcService,
                                                                    const char* p_pcProtocol,
                                                                    MDNSResponder::MDNSServiceQueryCallbackFn p_fnCallback,
                                                                    void* p_pUserdata) {
    hMDNSServiceQuery       hResult = 0;
    
    stcMDNSServiceQuery*    pServiceQuery = 0;
    if ((p_pcService) &&
        (os_strlen(p_pcService)) &&
        (p_pcProtocol) &&
        (os_strlen(p_pcProtocol)) &&
        (p_fnCallback) &&
        ((pServiceQuery = _allocServiceQuery())) &&
        (_buildDomainForService(p_pcService, p_pcProtocol, pServiceQuery->m_ServiceTypeDomain))) {

        pServiceQuery->m_fnCallback = p_fnCallback;
        pServiceQuery->m_pUserdata = p_pUserdata;
        pServiceQuery->m_bLegacyQuery = false;
        
        if (_sendMDNSServiceQuery(*pServiceQuery)) {
            hResult = (hMDNSServiceQuery)pServiceQuery;
        }
        else {
            _removeServiceQuery(pServiceQuery);
        }
    }
    DEBUG_EX_ERR(if (!hResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] installServiceQuery: FAILED for '%s.%s'!\n"), (p_pcService ?: "-"), (p_pcProtocol ?: "-")); } );    
    return hResult;
}

/*
 * MDNSResponder::removeServiceQuery
 *
 * Remove a dynamic service query (and all collected answers) from the MDNS responder
 *
 */
bool MDNSResponder::removeServiceQuery(MDNSResponder::hMDNSServiceQuery p_hServiceQuery) {
    
    stcMDNSServiceQuery*    pServiceQuery = 0;
    bool    bResult = (((pServiceQuery = _findServiceQuery(p_hServiceQuery))) &&
                       (_removeServiceQuery(pServiceQuery)));
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] removeServiceQuery: FAILED!\n")); } );    
    return bResult;
}

/*
 * MDNSResponder::answerCount
 */
uint32_t MDNSResponder::answerCount(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery) {
    
    stcMDNSServiceQuery*    pServiceQuery = _findServiceQuery(p_hServiceQuery);
    return (pServiceQuery ? pServiceQuery->answerCount() : 0);
}

/*
 * MDNSResponder::answerServiceDomain
 *
 * Returns the domain for the given service.
 * If not already existing, the string is allocated, filled and attached to the answer.
 *
 */
const char* MDNSResponder::answerServiceDomain(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                               const uint32_t p_u32AnswerIndex) {

    stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
    stcMDNSServiceQuery::stcAnswer* pSQAnswer = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
    // Fill m_pcServiceDomain (if not already done)
    if ((pSQAnswer) &&
        (pSQAnswer->m_ServiceDomain.m_u16NameLength) &&
        (!pSQAnswer->m_pcServiceDomain)) {
        
        pSQAnswer->m_pcServiceDomain = pSQAnswer->allocServiceDomain(pSQAnswer->m_ServiceDomain.c_strLength());
        if (pSQAnswer->m_pcServiceDomain) {
            pSQAnswer->m_ServiceDomain.c_str(pSQAnswer->m_pcServiceDomain);
        }
    }
    return (pSQAnswer ? pSQAnswer->m_pcServiceDomain : 0);
}

/*
 * MDNSResponder::hasAnswerHostDomain
 */
bool MDNSResponder::hasAnswerHostDomain(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                        const uint32_t p_u32AnswerIndex) {

    stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
    stcMDNSServiceQuery::stcAnswer* pSQAnswer = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
    return ((pSQAnswer) &&
            (pSQAnswer->m_u32ContentFlags & ServiceQueryAnswerType_HostDomainAndPort));
}
                                            
/*
 * MDNSResponder::answerHostDomain
 *
 * Returns the host domain for the given service.
 * If not already existing, the string is allocated, filled and attached to the answer.
 * 
 */ 
const char* MDNSResponder::answerHostDomain(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                            const uint32_t p_u32AnswerIndex) {

    stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
    stcMDNSServiceQuery::stcAnswer* pSQAnswer = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
    // Fill m_pcHostDomain (if not already done)
    if ((pSQAnswer) &&
        (pSQAnswer->m_HostDomain.m_u16NameLength) &&
        (!pSQAnswer->m_pcHostDomain)) {
        
        pSQAnswer->m_pcHostDomain = pSQAnswer->allocHostDomain(pSQAnswer->m_HostDomain.c_strLength());
        if (pSQAnswer->m_pcHostDomain) {
            pSQAnswer->m_HostDomain.c_str(pSQAnswer->m_pcHostDomain);
        }
    }
    return (pSQAnswer ? pSQAnswer->m_pcHostDomain : 0);
}

#ifdef MDNS_IP4_SUPPORT
    /*
     * MDNSResponder::hasAnswerIP4Address
     */
    bool MDNSResponder::hasAnswerIP4Address(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                            const uint32_t p_u32AnswerIndex) {

        stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer* pSQAnswer = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        return ((pSQAnswer) &&
                (pSQAnswer->m_u32ContentFlags & ServiceQueryAnswerType_IP4Address));
    }
    
    /*
     * MDNSResponder::answerIP4AddressCount
     */
    uint32_t MDNSResponder::answerIP4AddressCount(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                                  const uint32_t p_u32AnswerIndex) {
        
        stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer* pSQAnswer = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        return (pSQAnswer ? pSQAnswer->IP4AddressCount() : 0);
    }

