LaborEtArs/ESP8266mDNS/src/ESP8266mDNSv2.cpp
    /*
     * MDNSResponder::answerIP4Address
     */
    IPAddress MDNSResponder::answerIP4Address(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                              const uint32_t p_u32AnswerIndex,
                                              const uint32_t p_u32AddressIndex) {

        stcMDNSServiceQuery*                            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer*                 pSQAnswer = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        stcMDNSServiceQuery::stcAnswer::stcIP4Address*  pIP4Address = (pSQAnswer ? pSQAnswer->IP4AddressAtIndex(p_u32AddressIndex) : 0);
        return (pIP4Address ? pIP4Address->m_IPAddress : IPAddress());
    }
#endif

#ifdef MDNS_IP6_SUPPORT
    /*
     * MDNSResponder::hasAnswerIP6Address
     */
    bool MDNSResponder::hasAnswerIP6Address(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                            const uint32_t p_u32AnswerIndex) {

        stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer* pSQAnswer = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        return ((pSQAnswer) &&
                (pSQAnswer->m_u32ContentFlags & ServiceQueryAnswerType_HostIP6Address));
    }
    
    /*
     * MDNSResponder::answerIP6AddressCount
     */
    uint32_t MDNSResponder::answerIP6AddressCount(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                                  const uint32_t p_u32AnswerIndex) {
        
        stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer* pSQAnswer = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        return (pSQAnswer ? pSQAnswer->IP6AddressCount() : 0);
    }

    /*
     * MDNSResponder::answerIP6Address
     */
    IPAddress MDNSResponder::answerIP6Address(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                              const uint32_t p_u32AnswerIndex,
                                              const uint32_t p_u32AddressIndex) {

        stcMDNSServiceQuery*                            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer*                 pSQAnswer = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        stcMDNSServiceQuery::stcAnswer::stcIP6Address*  pIP6Address = (pSQAnswer ? pSQAnswer->IP6AddressAtIndex(p_u32AddressIndex) : 0);
        return (pIP6Address ? pIP6Address->m_IPAddress : IPAddress());
    }
#endif

/*
 * MDNSResponder::hasAnswerPort
 */
bool MDNSResponder::hasAnswerPort(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                  const uint32_t p_u32AnswerIndex) {

    stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
    stcMDNSServiceQuery::stcAnswer* pSQAnswer = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
    return ((pSQAnswer) &&
            (pSQAnswer->m_u32ContentFlags & ServiceQueryAnswerType_HostDomainAndPort));
}

/*
 * MDNSResponder::answerPort
 */
uint16_t MDNSResponder::answerPort(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                   const uint32_t p_u32AnswerIndex) {

    stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
    stcMDNSServiceQuery::stcAnswer* pSQAnswer = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
    return (pSQAnswer ? pSQAnswer->m_u16Port : 0);
}

/*
 * MDNSResponder::hasAnswerTxts
 */
bool MDNSResponder::hasAnswerTxts(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                  const uint32_t p_u32AnswerIndex) {

    stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
    stcMDNSServiceQuery::stcAnswer* pSQAnswer = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
    return ((pSQAnswer) &&
            (pSQAnswer->m_u32ContentFlags & ServiceQueryAnswerType_Txts));
}

/*
 * MDNSResponder::answerTxts
 *
 * Returns all TXT items for the given service as a ';'-separated string.
 * If not already existing; the string is alloced, filled and attached to the answer.
 *
 */
const char* MDNSResponder::answerTxts(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                      const uint32_t p_u32AnswerIndex) {

    stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
    stcMDNSServiceQuery::stcAnswer* pSQAnswer = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
    // Fill m_pcTxts (if not already done)
    if ((pSQAnswer) &&
        (pSQAnswer->m_Txts.m_pTxts) &&
        (!pSQAnswer->m_pcTxts)) {
        
        pSQAnswer->m_pcTxts = pSQAnswer->allocTxts(pSQAnswer->m_Txts.c_strLength());
        if (pSQAnswer->m_pcTxts) {
            pSQAnswer->m_Txts.c_str(pSQAnswer->m_pcTxts);
        }
    }
    return (pSQAnswer ? pSQAnswer->m_pcTxts : 0);
}


/*
 * PROBING
 */

/*
 * MDNSResponder::setProbeResultCallback
 *
 * Set a global callback for probe results. The callback is called, when probing
 * for the host domain (or a service domain, without specific probe result callback)
 * failes or succeedes.
 * In the case of failure, the domain name should be changed via 'setHostname' or 'setServiceName'.
 * When succeeded, the host or service domain will be announced by the MDNS responder.
 *
 */
bool MDNSResponder::setProbeResultCallback(MDNSResponder::MDNSProbeResultCallbackFn p_fnCallback,
                                           void* p_pUserdata) {
    
    m_HostProbeInformation.m_fnProbeResultCallback = p_fnCallback;
    m_HostProbeInformation.m_pProbeResultCallbackUserdata = p_pUserdata;
    
    return true;
}

/*
 * MDNSResponder::setServiceProbeResultCallback
 *
 * Set a service specific callback for probe results. The callback is called, when probing
 * for the service domain failes or succeedes.
 * In the case of failure, the service name should be changed via 'setServiceName'.
 * When succeeded, the service domain will be announced by the MDNS responder.
 *
 */
bool MDNSResponder::setServiceProbeResultCallback(const MDNSResponder::hMDNSService p_hService,
                                                  MDNSResponder::MDNSProbeResultCallbackFn p_fnCallback,
                                                  void* p_pUserdata) {
    bool    bResult = false;

