LaborEtArs/ESP8266mDNS/src/ESP8266mDNSv2.cpp
    stcMDNSService* pService = _findService(p_hService);
    if (pService) {
        pService->m_ProbeInformation.m_fnProbeResultCallback = p_fnCallback;
        pService->m_ProbeInformation.m_pProbeResultCallbackUserdata = p_pUserdata;

        bResult = true;
    }
    return bResult;
}


/*
 * MISC
 */

/*
 * MDNSResponder::notifyAPChange
 *
 * Should be called, whenever the AP for the MDNS responder changes.
 * A bit of this is caught by the event callbacks installed in the constructor.
 *
 */
bool MDNSResponder::notifyAPChange(void) {
    
    return _restart();
}

/*
 * MDNSResponder::update
 *
 * Should be called in every 'loop'.
 *
 */
bool MDNSResponder::update(void) {
    
    return _process(true);
}

/*
 * MDNSResponder::announce
 *
 * Should be called, if the 'configuration' changes. Mainly this will be changes in the TXT items...
 */
bool MDNSResponder::announce(void) {
    
    return (_announce());
}       

/*
 * MDNSResponder::enableArduino
 *
 * Enable the OTA update service.
 *
 */
MDNSResponder::hMDNSService MDNSResponder::enableArduino(uint16_t p_u16Port,
                                                         bool p_bAuthUpload /*= false*/) {
    
    hMDNSService    hService = addService(0, "arduino", "tcp", p_u16Port);
    if (hService) {
        if ((!addServiceTxt(hService, "tcp_check", "no")) ||
           (!addServiceTxt(hService, "ssh_upload", "no")) ||
          (!addServiceTxt(hService, "board", STRINGIZE_VALUE_OF(ARDUINO_BOARD))) ||
          (!addServiceTxt(hService, "auth_upload", (p_bAuthUpload) ? "yes" : "no"))) {
           
           removeService(hService);
           hService = 0;
      }
    }
    return hService;
}

/*
 * MDNS responder global instance
 */
#if !defined(NO_GLOBAL_INSTANCES) && !defined(NO_GLOBAL_MDNS)
MDNSResponder   MDNS;
#endif

}   // namespace LEA_MDNSResponder



